#Просим пользователя ввести первое число
print("Введите первый элемент прогрессии b:")
b = int(input())
#Просим пользователя ввести множитель
print("Введите множитель прогрессии q:")
q = int(input())
#Просим пользователя ввести количество элементов
print("Введите номер последнего элемента n:")
n = int(input())
#Считаем сумму геометрической прогрессии
if -10000 <= b <= 10000 and 1 <= q <= 50 and 2 <= n <= 100:
    # Если всё верно, считаем сумму
    if q == 1:
        r = b * n
    else:
        r = b * (q**n - 1) / (q - 1)
    print(r)
else:
    print("Ошибка")